Revit 2027 API
ParameterTypeId.LegendComponentDetailLevel Property
 "Detail Level"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId LegendComponentDetailLevel { get; }
Public Shared ReadOnly Property LegendComponentDetailLevel As ForgeTypeId
	Get
public:
static property ForgeTypeId^ LegendComponentDetailLevel {
	ForgeTypeId^ get ();
}
static member LegendComponentDetailLevel : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace